#+OPTIONS: toc: nil
** 添加元素

#+BEGIN_SRC python :results output
  lst = list(range(10))
  # 生成的是一个新的列表
  print(lst + [1,2,3])
  # 改变的是lst的值
  lst.append('a')
  print(lst)

  a = [1,2,3]
  b = [3,4,5]
  a.append(b)
  print(a)

  m = [1,3,4]
  n = [3,4,5]
  m.extend(n)
  print(m)
#+END_SRC

#+RESULTS:
: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 1, 2, 3]
: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 'a']
: [1, 2, 3, [3, 4, 5]]
: [1, 3, 4, 3, 4, 5]

** 删除元素

   #+BEGIN_SRC python :results output
     lst = list(range(10))
     print(lst)
     lst.remove(5)

     del lst[2:4]
     print(lst)

     # New in version 3.3 clear() and copy()methods
     # lst.clear() same as del lst[:] and lst[:] = []
     # lst.clear()
     # lst[:] =
     del lst[:]
     print(lst)
   #+END_SRC

   #+RESULTS:
   : [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
   : [0, 1, 4, 6, 7, 8, 9]
   : []
** 插入元素

#+BEGIN_SRC python :results output
  lst = list(range(10))
  print(lst)
  lst.insert(3,'a')
  print(lst)

  lst.insert(5,[1,2,3])
  print(lst)
#+END_SRC

#+RESULTS:
: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
: [0, 1, 2, 'a', 3, 4, 5, 6, 7, 8, 9]
: [0, 1, 2, 'a', 3, [1, 2, 3], 4, 5, 6, 7, 8, 9]
** 复制

#+BEGIN_SRC python :results output
  lst = list(range(10))
  # lst and lst1 point to the same list
  lst1 = lst
  lst1[2] = 'hello'
  print(lst,lst1)

  lst = list(range(10))
  # lst.copy() copy a new list
  lst2 = lst.copy()
  lst2[2] = 'hello'
  print(lst,lst2)
#+END_SRC

#+RESULTS:
: ([0, 1, 'hello', 3, 4, 5, 6, 7, 8, 9], [0, 1, 'hello', 3, 4, 5, 6, 7, 8, 9])
: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9] [0, 1, 'hello', 3, 4, 5, 6, 7, 8, 9]
** 排序

#+BEGIN_SRC python :results output
  lst1 = [12,45,32,98,45,66,3]
  lst2 = ["asd","cxv","ghv"]
  lst3 = ["asd","cxv","bhv"]
  lst1.sort()
  lst2.sort()
  lst3.sort()
  print(lst1)
  print(lst2)
  print(lst3)

  lst1.sort(reverse = True)
  lst2.sort(reverse = True)
  lst3.sort(reverse = True)
  print(lst1)
  print(lst2)
  print(lst3)

  # sorted --> sort and copy
  lst4 = sorted(lst1)
  print(lst1)
  print(lst4)
  lst4.append('hello')
  print(lst4)
#+END_SRC

#+RESULTS:
: [12, 45, 32, 98, 45, 66, 3]
: ['asd', 'cxv', 'ghv']
: ['asd', 'cxv', 'bhv']
: [98, 66, 45, 45, 32, 12, 3]
: ['ghv', 'cxv', 'asd']
: ['cxv', 'bhv', 'asd']
: [98, 66, 45, 45, 32, 12, 3]
: [3, 12, 32, 45, 45, 66, 98]
: [3, 12, 32, 45, 45, 66, 98, 'hello']
* 元祖tuple
不可变的“列表”

#+BEGIN_SRC python :results output
  # -*- coding:utf-8 -*-
  # python2.7写法
  # python3可以省略开头注释

  tup1 = ('physics','chemistry',1997,2000);
  tup2 = (1,2,3,4,5);
  # 可以不加括号
  tup3 = 'a','b','c','d'
  # 元组中只包含一个元素时，需要在元素后添加逗号
  tup4 = (50,)
  # 索引、切片和list一样
  print(tup1,tup3[:2])

  #元组不能单独删除内部元素（不可变性），但可以del语句来删除整个元组
  del tup3
  #print(tup3)

  print(len(tup1))
  print(tup1 + tup2)
  print(tup4 * 3)
  #序列通用函数
  print(max(tup2),min(tup2))

  lst = list(range(10))
  # tuple()函数：将列表转换为元组
  tup5 = tuple(lst)
  print(tup5)
#+END_SRC

#+RESULTS:
: (('physics', 'chemistry', 1997, 2000), ('a', 'b'))
: 4
: ('physics', 'chemistry', 1997, 2000, 1, 2, 3, 4, 5)
: (50, 50, 50)
: (5, 1)
: (0, 1, 2, 3, 4, 5, 6, 7, 8, 9)
** 字符串引号
#+BEGIN_SRC python :results output
  # -*- coding:utf-8 -*-
  # python3可以省略开头注释

  # 字符串引号

  str1 = "abc"
  str2 = 'abc'
  # 双引号单引号无区别，但文本中有引号的时候要相互交替使用
  str3 = 'my name is "fatbird"'
  # 需要多行字符串时候用三引号''' ''' """ """
  str4 = '''hello ! how are you ?
            I`m fine,thank you.'''
  print(str1)
  print(str2)
  print(str3)
  print(str4)
  #+END_SRC

  #+RESULTS:
  : abc
  : abc
  : my name is "fatbird"
  : hello ! how are you ?
  :           I`m fine,thank you.
** 转义字符
#+BEGIN_SRC python :results output
  # -*- coding:utf-8 -*-
  # python3可以省略开头注释

  # 转义字符
  # \' \" 分别输出单引号，双引号
  print('\'','\"')

  # \n 空行
  print('hello\nhow do you do ?')

  # 输出\, 所以文件路径用"/"或者"\\"
  print('\\')
#+END_SRC

#+RESULTS:
: ' "
: hello
: how do you do ?
: \
** 序列通用功能

#+BEGIN_SRC python :results output
  # -*- coding:utf-8 -*-
  # python3可以胜率开头注释

  # 序列通用功能
  # in/not in 判断是否存在
  print('a' in 'abc')
  # 文本连接
  print('我很帅' + '没错')
  # 文本复制
  print('handsome' * 4)

  # 索引、切片、步长
  st = 'abcdefg'
  print(st[2],st[-1])
  print(st[:2])
  print(st[::2])

  # .index()方法
  print(st.index('g'))

  # 计算字符串长度（思考这里能否把逗号换位"+"）
  print('st长度为：',len(st))
#+END_SRC

#+RESULTS:
: True
: 我很帅没错
: handsomehandsomehandsomehandsome
: c g
: ab
: aceg
: 6
: st长度为： 7
